LtyIntegrationTest/LtyTransaction/src/test/resources/data/json/Request_LTYTransaction_EnrollWithDiffTenders.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.macys.com/enterprise_services" xmlns:v12="http://loyalty.macys.com/schemas/loyalty.transaction/LtyTransactionRequest/v12_0" xmlns:v121="http://loyalty.macys.com/schemas/loyalty.common/LtyCommon/v12_0">
   <soapenv:Header>
      <ent:requestor_info>
         <version>12</version>
         <client_id>Stores</client_id>
         <subclient_id>SPOS</subclient_id>
      </ent:requestor_info>
   </soapenv:Header>
   <soapenv:Body>
      <v12:LtyTransactionReq>
         <v121:CommunicationHeader>
            <v121:Division>71</v121:Division>
            <v121:SourceApp>SPOS</v121:SourceApp>
            <v121:DeviceId>010001</v121:DeviceId>
            <v121:DeviceType>IPAD</v121:DeviceType>
            <v121:DeviceChannel>SPOS</v121:DeviceChannel>
            <v121:Stt>
               <v121:Date>DynamicDate</v121:Date>
               <v121:Store>95</v121:Store>
               <v121:RegisterNum>130</v121:RegisterNum>
               <v121:SalesTransNum>SalesTransValue</v121:SalesTransNum>
               <v121:Division>71</v121:Division>
            </v121:Stt>
            <v121:AssociateId>010001</v121:AssociateId>
            <v121:LTYVersion>12</v121:LTYVersion>
         </v121:CommunicationHeader>
         <v121:CustomerIdentifier>
            <v121:AccountType>L</v121:AccountType>
            <v121:AccountNumber>DynamicAccountNumber</v121:AccountNumber>
         </v121:CustomerIdentifier>
         <v12:TransactionHeader>
            <v121:AddedByApp>SPOS</v121:AddedByApp>
            <v121:FulfillmentChannel>SPOS</v121:FulfillmentChannel>
            <v121:TransactionType>PURCHASE</v121:TransactionType>
            <v121:AssociateId>01001</v121:AssociateId>
            <v12:SttInfo>
               <v121:Date>DynamicDate</v121:Date>
               <v121:Store>95</v121:Store>
               <v121:RegisterNum>130</v121:RegisterNum>
               <v121:SalesTransNum>SalesTransValue</v121:SalesTransNum>
               <v121:Division>71</v121:Division>
            </v12:SttInfo>
            <v12:OrderTimestamp>DynamicTimeStamp</v12:OrderTimestamp>
            <v12:ProcessTimestamp>DynamicTimeStamp</v12:ProcessTimestamp>
            <v12:OfflineRetryFlag>1</v12:OfflineRetryFlag>
         </v12:TransactionHeader>
         <v12:Tender>
            <v121:Type>dynamictendertypes</v121:Type>
            <v121:ReferenceId>dynamicreferenceids</v121:ReferenceId>
            <v121:Amt>149.98</v121:Amt>
         </v12:Tender>
         <v12:LineItem>
            <v121:SeqNum>1</v121:SeqNum>
            <v121:ItemOperationType>PURCHASE</v121:ItemOperationType>
            <v121:Division>71</v121:Division>
            <v121:Dept>Dept1</v121:Dept>
            <v121:Class>24</v121:Class>
            <v121:PriceStatus>1</v121:PriceStatus>
            <v121:OriginalRetailPrice>99.99</v121:OriginalRetailPrice>
            <v121:PriceSold>99.99</v121:PriceSold>
            <v121:Quantity>1</v121:Quantity>
            <v121:ItemDesc>american eagle</v121:ItemDesc>
            <v121:RegistryNum>01</v121:RegistryNum>
         </v12:LineItem>
         <v12:LineItem>
            <v121:SeqNum>2</v121:SeqNum>
            <v121:ItemOperationType>PURCHASE</v121:ItemOperationType>
            <v121:Division>71</v121:Division>
            <v121:Dept>Dept2</v121:Dept>
            <v121:Class>51</v121:Class>
            <v121:PriceStatus>1</v121:PriceStatus>
            <v121:OriginalRetailPrice>49.99</v121:OriginalRetailPrice>
            <v121:PriceSold>49.99</v121:PriceSold>
            <v121:Quantity>1</v121:Quantity>
            <v121:ItemDesc>jeans</v121:ItemDesc>
            <v121:RegistryNum>01</v121:RegistryNum>
         </v12:LineItem>
      </v12:LtyTransactionReq>
   </soapenv:Body>
</soapenv:Envelope>